src/Catalogs/ГруппыПользователейЦентрМониторинга/ГруппыПользователейЦентрМониторинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыПользователейЦентрМониторинга</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>РуководительГруппы</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УчастникиГруппы</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ГруппыПользователейЦентрМониторинга/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ДобавитьНовогоПользователяВБазуИГруппу(Команда)
	Записать();
	ПараметрыОткрытия = Новый Структура("Группа", Объект.Ссылка);
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьНовогоПользователяВБазуИГруппуЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.ГруппыПользователейЦентрМониторинга.Форма.ФормаСозданияИДобавленияПользователя", ПараметрыОткрытия,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовогоПользователяВБазуИГруппуЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	ЭтотОбъект.Прочитать();
КонецПроцедуры

&НаСервере
Процедура УдалитьПользователяВБазеИГруппеНаСервере(Пользователь)	
	ОбъектПользователь = Пользователь.ПолучитьОбъект();
	УстановитьПривилегированныйРежим(Истина);
	ОбъектГруппа = РеквизитФормыВЗначение("Объект");
	ОбъектГруппа.УчастникиГруппы.Удалить(ОбъектГруппа.УчастникиГруппы.Найти(Пользователь));
	ОбъектГруппа.Записать();
	ОбъектПользователь.Удалить();
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПользователяВБазеИГруппе(Команда)
	УдалитьПользователяВБазеИГруппеНаСервере(Элементы.УчастникиГруппы.ТекущиеДанные.Пользователь);
	ЭтотОбъект.Прочитать();
КонецПроцедуры
